GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, uart->dma_rx->dma_flag);
    /* Enable Full-Transfer interrupt only */
    dma_interrupt_enable(uart->dma_rx->periph, uart->dma_rx->channel, DMA_CHXCTL_FTFIE);
}

static void gd32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

#ifdef SOC_SERIES_GD32H7xx
    /*
     * Allocate cache-line aligned DMA buffer to avoid D-Cache coherency issues.
     * ARM Cortex-M7 cache line is 32 bytes. If the DMA buffer shares a cache line
     * with other data (like serial_tx->data_queue), cache invalidate operations
     * will corrupt that data.
     */
#define RT_DMA_CACHE_LINE_SIZE  32
    if (uart->dma_rx_buffer == RT_NULL)
    {
        /* rx_fifo->buffer doesn't align with 32 bytes, so create a cache buffer with 32 bytes aligned */
        uart->dma_rx_buffer = (rt_uint8_t *)rt_malloc_align(serial->config.bufsz, RT_DMA_CACHE_LINE_SIZE);
        RT_ASSERT(uart->dma_rx_buffer != RT_NULL);
        rt_memset(uart->dma_rx_buffer, 0, serial->config.bufsz);
    }
    /* Point rx_fifo->buffer to our aligned buffer */
    rx_fifo->buffer = uart->dma_rx_buffer;
#endif

    /* Clear IDLE flag if set (read STAT then DATA to clear) */
    if(SET == usart_flag_get(uart->uart_periph, USART_FLAG_IDLE)) {
        usart_flag_clear(uart->uart_periph, USART_FLAG_IDLE);
        usart_data_receive(uart->uart_periph);
    }

    /* enable idle interrupt */
    usart_interrupt_enable(uart->uart_periph, USART_INT_IDLE);
    /* DMA clock enable */
    if(DMA0 == uart->dma_rx->periph) {
        rcu_periph_clock_enable(RCU_DMA0);
    } else if(DMA1 == uart->dma_rx->periph) {
        rcu_periph_clock_enable(RCU_DMA1);
    } else {
        Error_Handler();
    }

#ifdef SOC_SERIES_GD32H7xx
    /* enable DMAMUX clock */
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

#ifdef RT_USING_CACHE
    /* clean d-cache */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, rx_fifo->buffer, serial->config.bufsz);
#endif

    /* rx dma config */
    dma_uart_config(serial, serial->config.bufsz, rx_fifo->buffer);

    usart_dma_receive_config(uart->uart_periph, USART_RECEIVE_DMA_ENABLE);
    dma_channel_enable(uart->dma_rx->periph, uart->dma_rx->channel);
    /* rx dma interrupt config */
    nvic_irq_enable(uart->dma_rx->irq, 1, 0);
}

#ifdef BSP_SERIAL_USING_TX_DMA
static void gd32_dma_tx_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    dma_single_data_parameter_struct dma_init_struct;

    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    /* DMA clock enable */
    if(DMA0 == uart->dma_tx->periph) {
        rcu_periph_clock_enable(RCU_DMA0);
    } else if(DMA1 == uart->dma_tx->periph) {
        rcu_periph_clock_enable(RCU_DMA1);
    } else {
        Error_Handler();
    }

#ifdef SOC_SERIES_GD32H7xx
    /* enable DMAMUX clock */
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

    /* tx dma config */
    dma_deinit(uart->dma_tx->periph, uart->dma_tx->channel);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.direction    = DMA_MEMORY_TO_PERIPH;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
#ifdef SOC_SERIES_GD32H7xx
    dma_init_struct.request      = uart->dma_tx->request;
#endif
    dma_init_struct.number       = 0;   /* will be set in transmit function */
    dma_init_struct.memory0_addr = 0;   /* will be set in transmit function */
    dma_init_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_init_struct.periph_addr  = (uint32_t)USART_DATA_TX(uart->uart_periph);
    dma_single_data_mode_init(uart->dma_tx->periph, uart->dma_tx->channel, &dma_init_struct);
#if defined(SOC_SERIES_GD32F5xx)
    dma_channel_subperipheral_select(uart->dma_tx->periph, uart->dma_tx->channel, uart->dma_tx->subperiph);
#endif
    /* configure DMA mode */
    dma_circulation_disable(uart->dma_tx->periph, uart->dma_tx->channel);
}

static rt_ssize_t gd32_dma_transmit(struct rt_serial_device *serial, rt_uint8_t *buf, rt_size_t size, int direction)
{
    struct gd32_uart *uart;
    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    uart = (struct gd32_uart *) serial->parent.user_data;

    if (size == 0)
    {
        return 0;
    }

    if (RT_SERIAL_DMA_TX == direction)
    {
        /* Small transfers: use polling to avoid DMA setup overhead */
        if (size < GD32_DMA_TX_THRESHOLD)
        {
            rt_size_t i;
            int ret;
            rt_tick_t start_tick;
            rt_tick_t timeout_ticks = rt_tick_from_millisecond(GD32_POLL_TX_TIMEOUT_MS);

            for (i = 0; i < size; i++)
            {
                ret = gd32_uart_putc(serial, buf[i]);
                if (ret != RT_EOK)
                {
                    return ret;  /* timeout or error in putc */
                }
            }
            /* wait for last byte fully shifted out with timeout */
            start_tick = rt_tick_get();
            while (usart_flag_get(uart->uart_periph, USART_FLAG_TC) == RESET)
            {
                if ((rt_tick_get() - start_tick) > timeout_ticks)
                {
                    /* timeout error */
                    return -RT_ETIMEOUT;
                }
            }
            /* notify framework that transmission is complete */
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
            return size;
        }

#ifdef RT_USING_CACHE
        /*
         * Flush D-Cache to ensure DMA reads correct data from memory.
         * rt_hw_cpu_dcache_ops handles non-aligned addresses internally.
         */
        rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)buf, size);
#endif

        dma_memory_address_config(uart->dma_tx->periph, uart->dma_tx->channel, DMA_MEMORY_0, (uint32_t)buf);
        dma_transfer_number_config(uart->dma_tx->periph, uart->dma_tx->channel, size);

        dma_flag_clear(uart->dma_tx->periph, uart->dma_tx->channel, uart->dma_tx->dma_flag);
        dma_interrupt_enable(uart->dma_tx->periph, uart->dma_tx->channel, DMA_CHXCTL_FTFIE);

