GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
        usart_flag_clear(uart->uart_periph, USART_FLAG_TBE);
        usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
        /* enable transmit idle interrupt */
        usart_interrupt_enable(uart->uart_periph, USART_INT_TC);

        usart_dma_transmit_config(uart->uart_periph, USART_TRANSMIT_DMA_ENABLE);
        /* tx dma interrupt config */
        nvic_irq_enable(uart->dma_tx->irq, 1, 0);

        dma_channel_enable(uart->dma_tx->periph, uart->dma_tx->channel);

        return size;
    }
    return 0;
}
#endif

/**
 * Serial port receive idle process. This need add to uart idle ISR.
 *
 * @param serial serial device
 */
static void dma_uart_rx_idle_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    rt_size_t recv_total_index, recv_len;

    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

#ifdef RT_USING_CACHE
    /* Invalidate D-Cache before reading DMA buffer to get fresh data from RAM */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, rx_fifo->buffer, serial->config.bufsz);
#endif

    recv_total_index = uart->setting_recv_len -
                       dma_transfer_number_get(uart->dma_rx->periph, uart->dma_rx->channel);

    if (recv_total_index >= uart->last_recv_index) {
        recv_len = recv_total_index - uart->last_recv_index;
    } else {
        recv_len = uart->setting_recv_len - uart->last_recv_index + recv_total_index;
    }
    uart->last_recv_index = recv_total_index;

    if (recv_len) {
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
    }

    /* read a data for clear receive idle interrupt flag */
    usart_data_receive(uart->uart_periph);
    usart_flag_clear(uart->uart_periph, USART_FLAG_IDLE);
}

/**
 * DMA receive done process. This need add to DMA receive done ISR.
 * Uses non-circular mode: disable DMA, process data, re-enable DMA.
 *
 * @param serial serial device
 */
static void dma_rx_done_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    rt_size_t recv_len;

    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;

#ifdef RT_USING_CACHE
    /* Invalidate D-Cache before reading DMA buffer to get fresh data from RAM */
    rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, rx_fifo->buffer, serial->config.bufsz);
#endif

    if (dma_flag_get(uart->dma_rx->periph, uart->dma_rx->channel, uart->dma_rx->dma_flag) != RESET) {
        /* disable dma, stop receive data */
        dma_channel_disable(uart->dma_rx->periph, uart->dma_rx->channel);

        /*
         * FTF (Full Transfer Finished) interrupt means DMA counter reached 0,
         * so dma_transfer_number_get() always returns 0 here.
         * recv_total_index = setting_recv_len - 0 = setting_recv_len (buffer is full)
         * recv_len = setting_recv_len - last_recv_index (remaining bytes since last IDLE)
         */
        recv_len = uart->setting_recv_len - uart->last_recv_index;

        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));

        /* Restart DMA for next reception - must reconfigure in non-circular mode */
        dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, uart->dma_rx->dma_flag);
        /* Reset last_recv_index since DMA counter restarts from setting_recv_len */
        uart->last_recv_index = 0;
        /* Reconfigure DMA: reset transfer count and memory address */
        dma_memory_address_config(uart->dma_rx->periph, uart->dma_rx->channel, DMA_MEMORY_0, (uint32_t)rx_fifo->buffer);
        dma_transfer_number_config(uart->dma_rx->periph, uart->dma_rx->channel, uart->setting_recv_len);
        dma_channel_enable(uart->dma_rx->periph, uart->dma_rx->channel);
    }
}

#endif /* RT_SERIAL_USING_DMA */


/**
 * Uart common interrupt process. This need add to uart ISR.
 *
 * @param serial serial device
 */
static void GD32_UART_IRQHandler(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        /* USART5 in mode Receiver */
        if ((usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart5_flag_clear(USART5, USART5_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart5_flag_clear(USART5, USART5_FLAG_TC);
            usart5_interrupt_disable(USART5, USART5_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart5_flag_get(USART5, USART5_FLAG_ORERR) == SET)
        {
            usart5_flag_clear(USART5, USART5_FLAG_ORERR);
        }
    }
    else
#endif
    {
        /* UART in mode Receiver -------------------------------------------------*/
	    if ((usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_RBNE) != RESET) &&
	        (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
            usart_interrupt_disable(uart->uart_periph, USART_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart_flag_get(uart->uart_periph, USART_FLAG_ORERR) == SET)
        {
            usart_flag_clear(uart->uart_periph, USART_FLAG_ORERR);
        }
    }
}
static const struct rt_uart_ops gd32_uart_ops =
{
    .configure = gd32_uart_configure,
    .control = gd32_uart_control,
    .putc = gd32_uart_putc,
    .getc = gd32_uart_getc,
#ifndef BSP_SERIAL_USING_TX_DMA
    NULL,
#else
    .dma_transmit = gd32_dma_transmit,
#endif
};

/**
  * @brief  uart init
  * @param  None
  * @retval None
  */
int rt_hw_usart_init(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    int i;

    int result;
    rt_uint32_t flag = 0;

    for (i = 0; i < sizeof(uart_obj) / sizeof(uart_obj[0]); i++)
    {
        uart_obj[i].serial->ops    = &gd32_uart_ops;
        uart_obj[i].serial->config = config;

        flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;
#if defined(RT_SERIAL_USING_DMA)
        flag |= RT_DEVICE_FLAG_DMA_RX;
#if defined(BSP_SERIAL_USING_TX_DMA)
        flag |= RT_DEVICE_FLAG_DMA_TX;
#endif
#endif
        /* register UART1 device */
        result = rt_hw_serial_register(uart_obj[i].serial,
                              uart_obj[i].device_name,
                              flag,
                              (void *)&uart_obj[i]);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif
